Сравнитель/src/DataProcessors/ЗагрузкаВыгрузокДанных/ЗагрузкаВыгрузокДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаВыгрузокДанных</name>
</mdclass:DataProcessor>

Сравнитель/src/InformationRegisters/СравненияДанных/СравненияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СравненияДанных</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументаСравнениеДанных</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторВыгрузки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Сравнитель/src/InformationRegisters/ВыгрузкиДанных/ВыгрузкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыгрузкиДанных</name>
  <resources>
    <name>Выгрузка</name>
    <comment>Содержит строку. Хранилище следует максимально сжимать</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.СравнениеДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>База</name>
    <type>
      <types>EnumRef.НомераБаз</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Сравнитель/src/Enums/НомераБаз/НомераБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НомераБаз</name>
  <enumValues>
    <name>Первая</name>
  </enumValues>
  <enumValues>
    <name>Вторая</name>
  </enumValues>
</mdclass:Enum>

Сравнитель/src/Documents/СравнениеДанных/СравнениеДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СравнениеДанных</name>
  <registerRecords>InformationRegister.СравненияДанных</registerRecords>
  <attributes>
    <name>ПравилоСравненияДанных</name>
    <type>
      <types>CatalogRef.ПравилаСравненияДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВыгрузки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументаСравнениеДанных</types>
    </type>
  </attributes>
</mdclass:Document>

Сравнитель/src/DataProcessors/ЗагрузкаВыгрузокДанных/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция НовыйРезультатЗагрузки() Экспорт
	Результат = Новый Структура;
	
	Результат.Вставить("СравнениеДанныхСсылка", Документы.СравнениеДанных.ПустаяСсылка());
	Результат.Вставить("ТребуетсяВыборПравилаСравнения", Ложь);
	
	Возврат Результат;
КонецФункции

Функция ЗагрузитьВыгрузкуДанных(ВыгрузкаСтрокой, ПравилоСравненияДанных) Экспорт
	РезультатЗагрузки = НовыйРезультатЗагрузки();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ВыгрузкаСтрокой);
	ВыгрузкаXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ФабрикаXDTO.Тип("http://comparator.iryaboff.ru/v1/", "ВыгрузкаДанных"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СравненияДанных.Регистратор КАК Регистратор,
		|	СравненияДанных.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СравненияДанных КАК СравненияДанных
		|ГДЕ
		|	СравненияДанных.ИдентификаторВыгрузки = &ИдентификаторВыгрузки";
	
	Запрос.УстановитьПараметр("ИдентификаторВыгрузки", ВыгрузкаXDTO.ИдентификаторВыгрузки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокументы = РезультатЗапроса.Выбрать();
	
	НачатьТранзакцию();
	Попытка
		Если ВыборкаДокументы.Следующий() Тогда
			Документ = ВыборкаДокументы.Регистратор.ПолучитьОбъект();
			Документ.Заблокировать();
		ИначеЕсли Не ЗначениеЗаполнено(ПравилоСравненияДанных) Тогда
			РезультатЗагрузки.ТребуетсяВыборПравилаСравнения = Истина;
			Возврат РезультатЗагрузки;
		Иначе
			Документ = Документы.СравнениеДанных.СоздатьДокумент();
			Документ.Дата = ТекущаяДата();
			Документ.ПравилоСравненияДанных = ПравилоСравненияДанных;
			Документ.ИдентификаторВыгрузки = ВыгрузкаXDTO.ИдентификаторВыгрузки;
			
			Документ.Записать();
			Документ.Заблокировать();
		КонецЕсли;
		
		ЗаписьРегистраВыгрузок = РегистрыСведений.ВыгрузкиДанных.СоздатьМенеджерЗаписи();
		ЗаписьРегистраВыгрузок.Документ = Документ.Ссылка;
		ЗаписьРегистраВыгрузок.База = ?(ВыгрузкаXDTO.НомерБазы = 1, Перечисления.НомераБаз.Первая, Перечисления.НомераБаз.Вторая);
		ЗаписьРегистраВыгрузок.Выгрузка = Новый ХранилищеЗначения(ВыгрузкаСтрокой, Новый СжатиеДанных(9));
		
		ЗаписьРегистраВыгрузок.Записать();
		
		Документ.ОбновитьСтатус();
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		
		РезультатЗагрузки.СравнениеДанныхСсылка = Документ.Ссылка;
		
		ЗафиксироватьТранзакцию();
		Возврат РезультатЗагрузки;
	Исключение
	
	КонецПопытки;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
